Repository: JHdehao/Conch
Catalog: Conch/Localizable.xcstrings
Source language: zh_hans
Languages: en, zh_hant

source: 已输入。终端现在显示： %@
en: Typed. The terminal now shows: %@
zh_hant: 已輸入。終端現在顯示： %@

source: 已输入并按了回车。
en: Typed and pressed Return.
zh_hant: 已輸入並按了 Return。

source: 已输入，输入框现在是：“%@”
en: Typed. The field now contains: “%@”
zh_hant: 已輸入，輸入框現在是：「%@」

source: 已运行 %@
en: Up %@
zh_hant: 已執行 %@

source: 已连接
en: Connected
zh_hant: 已連線

source: 已连接到 %@
en: Connected to %@
zh_hant: 已連線到 %@

source: 已选择“%@”
en: Chose “%@”
zh_hant: 已選擇「%@」

source: 带上已知主机指纹，对方第一次连接这些服务器时就不用再确认。
en: With known host fingerprints, the other device won't have to confirm these servers on first connect.
zh_hant: 帶上已知主機指紋，對方第一次連線這些伺服器時就不用再確認。

source: 帮你排查一个问题
en: Help debug a problem
zh_hant: 幫你排查一個問題

source: 帮我添加一台服务器
en: Help me add a server
zh_hant: 幫我添加一台伺服器

source: 帮我连上 Tailscale 里的 NAS
en: Connect me to the NAS on my tailnet
zh_hant: 幫我連上 Tailscale 裡的 NAS

source: 常用
en: Suggested

source: 常规操作直接执行；删除数据、sudo、关机、改防火墙这类危险操作仍会先问你。
en: Routine actions run right away; risky ones like deleting data, sudo, shutting down or changing the firewall still ask first.
zh_hant: 常規操作直接執行；刪除資料、sudo、關機、改防火牆這類危險操作仍會先問你。

source: 应用并重新连接
en: Apply and Reconnect
zh_hant: 套用並重新連線

source: 开
en: on
zh_hant: 開

source: 开启“记录连接地点”后，每次连上服务器都会记下时间和大致地点。
en: With “Record Connection Locations” on, each connection to a server records the time and rough location.
zh_hant: 開啓“記錄連線地點”後，每次連上伺服器都會記下時間和大致地點。

source: 开启后，助手会记住你的偏好、环境和纠正过它的做法，新对话里也能用上。你也可以直接对它说“记住……”或“忘掉……”。记忆只保存在本机，但每次对话都会作为上下文发给所选的 AI 服务；不会记密码和密钥。
en: When on, the assistant remembers your preferences, your setup and the corrections you've made, and uses them in new conversations. You can also just say “remember…” or “forget…”. Memories are stored only on this device, but are sent to the AI service as context in each conversation. Passwords and keys are never remembered.
zh_hant: 開啓後，助手會記住你的偏好、環境和糾正過它的做法，新對話里也能用上。你也可以直接對它說“記住……”或“忘掉……”。記憶只保存在本機，但每次對話都會作為上下文發給所選的 AI 服務；不會記密碼和金鑰。

source: 开启后，每次连上都会进入同名 tmux 会话（没有就新建）。断线重连后回到原来的界面，正在运行的程序不会中断。服务器上需要装有 tmux。
en: When on, each connection enters the tmux session with this name (creating it if needed). After a reconnect you're back where you were, and running programs keep going. tmux must be installed on the server.
zh_hant: 開啓後，每次連上都會進入同名 tmux 會話（沒有就新建）。斷線重連後回到原來的界面，正在執行的程式不會中斷。伺服器上需要裝有 tmux。

source: 开始新对话
en: Start New Conversation
zh_hant: 開始新對話

source: 开始新对话（同 /new）
en: Start a new conversation (same as /new)
zh_hant: 開始新對話（同 /new）

source: 强度越高，想得越久、越仔细，也更慢、更费 token。
en: Higher effort thinks longer and more carefully, but is slower and uses more tokens.
zh_hant: 強度越高，想得越久、越仔細，也更慢、更費 token。

source: 当前
en: Current
zh_hant: 當前

source: 当前会用 %@
en: Currently uses %@
zh_hant: 當前會用 %@

source: 当前位置、剪贴板、设备状态
en: Current location, clipboard and device status
zh_hant: 目前位置、剪貼簿、裝置狀態

source: 当前屏幕的截图附在后面。要操作页面上的东西，先用 browser_find 或 browser_read（mode=viewport）拿到元素编号。
en: A screenshot of the current screen follows. To act on something on the page, first get its element number with browser_find or browser_read (mode=viewport).
zh_hant: 目前螢幕的截圖附在後面。要操作頁面上的東西，先用 browser_find 或 browser_read（mode=viewport）拿到元素編號。

source: 当前打开的连接会断开。
en: Open connections will be closed.
zh_hant: 目前開啟的連線會中斷。

source: 当前模型不接受图片或 PDF，这次只发送了文字和文件说明。
en: The current model doesn't accept images or PDFs, so only the text and a description of the files were sent.
zh_hant: 目前模型不接受圖片或 PDF，這次只傳送了文字和檔案說明。

source: 当前：%@
en: Current: %@
zh_hant: 目前：%@

source: 形状
en: Shape
zh_hant: 形狀

source: 待办
en: To-dos
zh_hant: 待辦

source: 很高
en: Extra High

source: 心跳
en: Heartbeat

source: 心跳间隔
en: Heartbeat Interval
zh_hant: 心跳間隔

source: 忘掉记忆 %@
en: Forget memory %@
zh_hant: 忘掉記憶 %@

source: 快速联网
en: Fast Lookup
zh_hant: 快速聯網

source: 快速联网：%@
en: Fast lookup: %@
zh_hant: 快速聯網：%@

source: 怎么连上我的电脑？
en: How do I connect to my computer?
zh_hant: 怎麼連上我的電腦？

source: 思考中…
en: Thinking…

source: 思考强度
en: Effort
zh_hant: 思考強度

source: 思考强度可以是：%@
en: Effort can be: %@
zh_hant: 思考強度可以是：%@

source: 思考强度：%@
en: Effort: %@
zh_hant: 思考強度：%@

source: 思考过程
en: Thinking
zh_hant: 思考過程

source: 总结这次对话
en: Summarize this conversation
zh_hant: 總結這次對話

source: 想做什么，直接告诉我。
en: Tell me what you'd like to do.
zh_hant: 想做什麼，直接告訴我。

source: 我可以直接读、改、整理共享文件夹里的文件（Word、Excel、PPT、PDF 都行，在微信里“用其他应用打开”选 Conch 就能发给我）；帮你添加服务器、连接、排查连不上的原因、在服务器上执行命令；能联网查资料、操作网页，在手机上直接运行 JavaScript 做计算和数据处理，把编程任务交给电脑上的 Claude Code / Codex；还能设提醒、查日程、看设备状态。有改动的操作，都会先问你。
en: I can read, edit and organize files in the shared folder (Word, Excel, PowerPoint and PDF too — in WeChat, choose “Open in Another App” › Conch to send them to me); add servers, connect, find out why a connection fails and run commands on servers; look things up online and work in web pages, run JavaScript right on the phone for calculations and data processing, and hand coding tasks to Claude Code / Codex on your computer; I can also set reminders, check your calendar and look at the device’s status. I’ll ask before anything that changes something.
zh_hant: 我可以直接讀、改、整理共享資料夾裡的檔案（Word、Excel、PPT、PDF 都行，在微信裡“用其他應用程式打開”選 Conch 就能傳給我）；幫你新增伺服器、連線、排查連不上的原因、在伺服器上執行指令；能上網查資料、操作網頁，在手機上直接執行 JavaScript 做計算和資料處理，把程式設計任務交給電腦上的 Claude Code / Codex；還能設提醒、查行程、看裝置狀態。有改動的操作，都會先問你。

source: 我已经允许你使用 %@，请继续刚才的任务。
en: I've allowed you to use %@. Please continue the task.
zh_hant: 我已經允許你使用 %@，請繼續剛才的任務。

source: 我的服务器
en: My Server
zh_hant: 我的伺服器

source: 我的设备
en: My Devices
zh_hant: 我的裝置

source: 我连不上服务器了，帮我看看
en: I can't connect to my server, can you take a look?
zh_hant: 我連不上伺服器了，幫我看看

source: 或继续之前的对话
en: Or Continue an Earlier Conversation
zh_hant: 或繼續之前的對話

source: 截取网页画面
en: Capturing the page
zh_hant: 擷取網頁畫面

source: 所有操作都直接执行，不再询问。只在你完全信任当前任务时使用。
en: Everything runs without asking. Only use this when you fully trust the task at hand.
zh_hant: 所有操作都直接執行，不再詢問。只在你完全信任當前任務時使用。

source: 所有语言
en: All Languages
zh_hant: 所有語言

source: 手电筒已关闭
en: Flashlight off
zh_hant: 手電筒已關閉

source: 手电筒已打开
en: Flashlight on
zh_hant: 手電筒已打開

source: 打不开
en: Can't Open
zh_hant: 打不開

# 打不开“%@”：%@
source: 打不开“%1$@”：%2$@
en: Couldn’t open “%@”: %@
zh_hant: 打不開「%@」：%@

source: 打不开这个 PDF
en: Can't open this PDF
zh_hant: 打不開這個 PDF

source: 打不开这个目录
en: Can't open this folder
zh_hant: 打不開這個目錄

source: 打开
en: Open
zh_hant: 打開

source: 打开 %@
en: Open %@
zh_hant: 打開 %@

source: 打开 AI 服务设置
en: Open AI service settings
zh_hant: 打開 AI 服務設定

source: 打开 Conch 时，附近的设备能看到这台设备，不在同一网络的设备也可以按上面的地址发过来。来自“我的设备”的内容会自动接收，其他设备发来时都会先问你。
en: While Conch is open, nearby devices can see this one, and devices on other networks can send to the addresses above. Transfers from My Devices are received automatically; others always ask first.
zh_hant: 打開 Conch 時，附近的裝置能看到這台裝置，不在同一網路的裝置也可以按上面的位址傳過來。來自「我的裝置」的內容會自動接收，其他裝置傳來時都會先問你。

source: 打开 Tailscale
en: Turn on Tailscale
zh_hant: 打開 Tailscale

source: 打开内置 Tailscale？
en: Turn on built-in Tailscale?
zh_hant: 打開內建 Tailscale？

source: 打开历史会话
en: Open chat history
zh_hant: 打開歷史對話

source: 打开手电筒
en: Turn On Flashlight
zh_hant: 打開手電筒

source: 打开文件时需要输入这个密码。Conch 不会记住它，忘了就打不开。
en: This password is needed to open the file. Conch doesn't remember it; if you forget it, the file can't be opened.
zh_hant: 打開檔案時需要輸入這個密碼。Conch 不會記住它，忘了就打不開。

source: 打开的会话：
en: Open sessions:
zh_hant: 打開的會話：

source: 打开的标签页
en: Open Tabs
zh_hant: 打開的分頁

source: 打开系统设置
en: Open System Settings
zh_hant: 打開系統設定

source: 打开终端
en: Open Terminal
zh_hant: 打開終端機

source: 打开网页
en: Open Web Page
zh_hant: 打開網頁

source: 打开网页：%@
en: Open page: %@
zh_hant: 打開網頁：%@

source: 打开这个链接？
en: Open this link?
zh_hant: 打開這個鏈接？

source: 打断正在做的这一步，马上把这条消息交给助手
en: Interrupt the current step and give this message to the assistant now
zh_hant: 打斷正在做的這一步，馬上把這條消息交給助手

source: 执行命令：%@
en: Run command: %@
zh_hant: 執行命令：%@

source: 批准并开始
en: Approve and Start
zh_hant: 核准並開始

source: 批量执行一组任务
en: Run a batch of tasks
zh_hant: 批量執行一組任務

source: 找不到段落 %@，先用 read_document 看编号
en: No paragraph %@; check the IDs with read_document first
zh_hant: 找不到段落 %@，先用 read_document 看編號

source: 找到 %lld 处：
en: Found %lld matches:
zh_hant: 找到 %lld 處：

source: 找到的电话和邮箱会发送给 AI 服务。
en: Phone numbers and emails found will be sent to the AI service.
zh_hant: 找到的電話和電子郵件會發送給 AI 服務。

source: 找找代码里可能的 bug
en: Look for possible bugs in the code
zh_hant: 找找程式碼里可能的 bug

source: 技能
en: Skill

# 把 %@ 的 %lld 页接在了后面
source: 把 %1$@ 的 %2$lld 页接在了后面
en: Appended the %2$lld pages of %1$@
zh_hant: 把 %@ 的 %lld 頁接在了後面

source: 把服务器、密钥和密码发给另一台装有 Conch 的设备，全程端到端加密。不在同一个网络时，可以导出成文件，用隔空投送、微信或邮件发过去。
en: Send servers, keys and passwords to another device with Conch, end-to-end encrypted. When you're not on the same network, export a file and send it by AirDrop, a messaging app or email.
zh_hant: 把伺服器、金鑰和密碼傳給另一台裝有 Conch 的裝置，全程端對端加密。不在同一個網路時，可以匯出成檔案，用 AirDrop、微信或郵件傳過去。

source: 拍照
en: Take Photo

source: 拒绝
en: Deny
zh_hant: 拒絕

source: 拷贝公钥
en: Copy Public Key
zh_hant: 拷貝公鑰

source: 拷贝公钥，粘贴到服务器的 ~/.ssh/authorized_keys
en: Copy the public key and paste it into ~/.ssh/authorized_keys on the server
zh_hant: 拷貝公鑰，粘貼到伺服器的 ~/.ssh/authorized_keys

source: 拷贝地址
en: Copy Address
zh_hant: 拷貝位址

source: 拷贝最后一条回复
en: Copy the last reply
zh_hant: 拷貝最後一則回覆

source: 拷贝链接
en: Copy Link
zh_hant: 拷貝連結

source: 按 %@ 键
en: Press %@
zh_hant: 按 %@ 鍵

source: 按地址发送
en: Send by Address
zh_hant: 按位址傳送

source: 按间隔重复执行一个任务
en: Repeat a task on an interval
zh_hant: 按間隔重復執行一個任務

source: 排序
en: Sort

source: 排队的消息没有发送。
en: The queued message wasn't sent.
zh_hant: 排隊的訊息沒有發送。

source: 接口地址
en: API Address
zh_hant: 介面位址

source: 接口地址或模型名不对（404）。 %@
en: The API address or model name is wrong (404). %@
zh_hant: 介面位址或模型名不對（404）。 %@

source: 接口类型
en: API Type
zh_hant: 介面類型

source: 接收
en: Accept

source: 控制服务器
en: Control Server
zh_hant: 控制伺服器

source: 提交
en: Submit
zh_hant: 送出

source: 提醒
en: Reminder

source: 提问
en: Question
zh_hant: 提問

source: 插入
en: Insert

source: 插入并回车
en: Insert and Return
zh_hant: 插入並按 Return

source: 搜索
en: Search

source: 搜索了 %lld 次
en: searched %lld times
zh_hant: 搜尋了 %lld 次

source: 搜索引擎
en: Search Engine
zh_hant: 搜尋引擎

source: 搜索或输入网址
en: Search or enter website
zh_hant: 搜尋或輸入網址

source: 搜索服务器
en: Search Servers
zh_hant: 搜索伺服器

source: 搜索网页
en: Search the Web
zh_hant: 搜索網頁

source: 搜索联系人：%@
en: Search contacts: %@
zh_hant: 搜索聯繫人：%@

source: 搜索：%@
en: Search: %@
zh_hant: 搜尋：%@

source: 撤回到输入框
en: Back to the input box
zh_hant: 撤回到輸入框

source: 撤回同意
en: Withdraw

source: 支持 OpenAI 的 Responses 和 Chat Completions 两种接口（需要支持工具调用），比如 OpenAI、OpenCode Go、DeepSeek、通义千问、Kimi、本地 Ollama。接口地址填到 /v1 为止。“自动”会按服务和模型选择：%@
en: Works with OpenAI's Responses and Chat Completions APIs (tool calling required), e.g. OpenAI, OpenCode Go, DeepSeek, Qwen, Kimi or a local Ollama. Enter the address up to /v1. “Auto” picks by service and model: %@
zh_hant: 支援 OpenAI 的 Responses 和 Chat Completions 兩種介面（需要支援工具呼叫），比如 OpenAI、OpenCode Go、DeepSeek、通義千問、Kimi、本機 Ollama。介面位址填到 /v1 為止。“自動”會按服務和模型選擇：%@

# 收不下“%@”：%@
source: 收不下“%1$@”：%2$@
en: Couldn't take in “%@”: %@
zh_hant: 收不下“%@”：%@

source: 收到的文件
en: Received
zh_hant: 收到的檔案

source: 改写了 %@
en: Rewrote %@
zh_hant: 改寫了 %@

source: 数字一致，发送
en: Codes Match, Send
zh_hant: 數字一致，傳送

source: 整个文件夹（%lld 个文件）都会删除，不能恢复
en: The whole folder (%lld files) will be deleted. This can't be undone.
zh_hant: 整個資料夾（%lld 個檔案）都會刪除，不能恢復

source: 整理文件 %@
en: Organize %@
zh_hant: 整理檔案 %@

source: 文件…
en: File…
zh_hant: 檔案…

source: 文件密码
en: File Password
zh_hant: 檔案密碼

source: 文件已删除
en: File deleted
zh_hant: 檔案已刪除

source: 文件用了不支持的压缩方式：%@
en: The file uses an unsupported compression method: %@
zh_hant: 檔案用了不支援的壓縮方式：%@

source: 文件里有密码、私钥或 API Key 时必须设置文件密码。
en: A file password is required when the file contains passwords, private keys or API keys.
zh_hant: 檔案裡有密碼、私密金鑰或 API Key 時必須設定檔案密碼。

source: 文件里的 %@ 已损坏
en: %@ in the file is damaged
zh_hant: 檔案裡的 %@ 已損壞

source: 文字
en: Text

source: 文本
en: text
zh_hant: 文字

source: 文档里找不到“%@”（替换只在同一段内查找）
en: “%@” isn't in the document (replace only matches within one paragraph)
zh_hant: 文檔裡找不到“%@”（替換只在同一段內查找）

source: 断开 %@
en: Disconnect %@
zh_hant: 中斷 %@

source: 断开连接
en: Disconnect
zh_hant: 中斷連線

source: 断线判定
en: Drop Detection
zh_hant: 斷線判定

source: 断线重连中（第 %lld 次）
en: Reconnecting (attempt %lld)
zh_hant: 斷線重連中（第 %lld 次）

source: 新增 %lld 台服务器
en: added %lld servers
zh_hant: 新增 %lld 台伺服器

source: 新增 %lld 把密钥
en: added %lld keys
zh_hant: 新增 %lld 把金鑰

source: 新对话
en: New Conversation
zh_hant: 新對話

source: 新建提醒事项：%@
en: New reminder: %@
zh_hant: 新建提醒事項：%@

source: 新建文件夹 %@
en: New folder %@
zh_hant: 新建資料夾 %@

source: 新建文件夹 %@？
en: Create folder %@?
zh_hant: 新建資料夾 %@？

source: 新建日程：%@
en: New event: %@
zh_hant: 新建行事曆事件：%@

source: 新建服务器
en: New Server
zh_hant: 新建伺服器

source: 新建服务器…
en: New Server…
zh_hant: 新建伺服器…

source: 新建浏览器标签页
en: New Browser Tab
zh_hant: 新增瀏覽器標籤頁

source: 新建浏览器标签页（⌘T）
en: New Browser Tab (⌘T)
zh_hant: 新增瀏覽器標籤頁（⌘T）

source: 新建浏览器标签页（⌘⇧B）
en: New Browser Tab (⌘⇧B)
zh_hant: 新增瀏覽器標籤頁（⌘⇧B）

source: 新标签页
en: New Tab
zh_hant: 新標籤頁

source: 方向
en: Direction

source: 方块
en: Block
zh_hant: 方塊

# 旋转了 %lld 页（%lld°）
source: 旋转了 %1$lld 页（%2$lld°）
en: Rotated %lld pages (%lld°)
zh_hant: 旋轉了 %lld 頁（%lld°）

source: 无法开始录音：%@
en: Couldn't start recording: %@
zh_hant: 無法開始錄音：%@

source: 无法打开数据库：%@
en: Couldn't open the database: %@
zh_hant: 無法打開資料庫：%@

source: 无法解析 AI 服务的响应。
en: Couldn't read the AI service's response.
zh_hant: 無法解析 AI 服務的響應。

source: 无法解析主机名。
en: Couldn't resolve the host name.
zh_hant: 無法解析主機名稱。

source: 无法识别的私钥格式。请使用 OpenSSH 格式（以 “BEGIN OPENSSH PRIVATE KEY” 开头）。旧的 PEM 格式可用 ssh-keygen -p -f <文件> 转换。
en: Unrecognized private key format. Use the OpenSSH format (starting with “BEGIN OPENSSH PRIVATE KEY”). Older PEM keys can be converted with ssh-keygen -p -f <file>.
zh_hant: 無法辨識的私鑰格式。請使用 OpenSSH 格式（以 “BEGIN OPENSSH PRIVATE KEY” 開頭）。舊的 PEM 格式可用 ssh-keygen -p -f <檔案> 轉換。

source: 日光
en: Daylight

source: 时间
en: Time
zh_hant: 時間

source: 时间范围
en: Time Range
zh_hant: 時間範圍

source: 明早 8 点提醒我检查服务器备份
en: Remind me to check the server backups at 8 tomorrow morning
zh_hant: 明早 8 點提醒我檢查伺服器備份

source: 显示原文
en: Show Original
zh_hant: 顯示原文

source: 显示隐藏文件
en: Show Hidden Files
zh_hant: 顯示隱藏檔案

source: 普通话（中国大陆）
en: Mandarin (Chinese mainland)
zh_hant: 普通話（中國大陸）

source: 普通话（台湾）
en: Mandarin (Taiwan)
zh_hant: 普通話（台灣）

source: 暂不支持 %@ 类型的密钥，请使用 Ed25519 或 RSA。
en: %@ keys aren't supported yet. Use Ed25519 or RSA.
zh_hant: 暫不支援 %@ 類型的金鑰，請使用 Ed25519 或 RSA。

source: 暂不支持这台服务器
en: This Server Isn’t Supported Yet
zh_hant: 暫不支援這台伺服器

source: 暂时连不上 Tailscale 的服务器，正在自动重试。如果一直这样，请检查网络，或者在代理里放行 tailscale.com。
en: Can't reach Tailscale's servers right now; retrying automatically. If this keeps happening, check your network, or allow tailscale.com in your proxy.
zh_hant: 暫時連不上 Tailscale 的伺服器，正在自動重試。如果一直這樣，請檢查網路，或者在代理裡放行 tailscale.com。

source: 更多
en: More

source: 更多语言…
en: More Languages…
zh_hant: 更多語言…

source: 更新 %lld 台
en: updated %lld

source: 更新待办
en: Update To-dos
zh_hant: 更新待辦

source: 替换 %lld 处
en: Replace %lld occurrences
zh_hant: 取代 %lld 處

source: 替换 1 处
en: Replace 1 occurrence
zh_hant: 取代 1 處

source: 最低
en: Minimal

source: 最快、最省，适合简单任务
en: Fastest and cheapest, for simple tasks
zh_hant: 最快、最省，適合簡單任務

source: 最新一代的 Fable 模型
en: The latest Fable model

source: 最近
en: Recent

source: 最近用过
en: Recent
zh_hant: 最近用過

source: 最高
en: Max

source: 有线
en: Wired
zh_hant: 有線

source: 有连接时自动开始
en: Starts automatically while connected
zh_hant: 有連線時自動開始

source: 服务商
en: Provider
zh_hant: 服務商

source: 服务器
en: Servers
zh_hant: 伺服器

source: 服务器上找不到 mosh-server。请先在服务器上安装 mosh（apt install mosh、brew install mosh 等），或在服务器设置里填写 mosh-server 的完整路径。%@
en: mosh-server wasn't found on the server. Install mosh there first (apt install mosh, brew install mosh, etc.), or enter the full path to mosh-server in the server settings. %@
zh_hant: 伺服器上找不到 mosh-server。請先在伺服器上安裝 mosh（apt install mosh、brew install mosh 等），或在伺服器設定里填寫 mosh-server 的完整路徑。%@

source: 服务器上需要装好 mosh，并放行 UDP 60000–61000 端口。如果 mosh-server 不在 PATH 里，在这里填完整路径。
en: mosh must be installed on the server, with UDP ports 60000–61000 open. If mosh-server isn't on the PATH, enter its full path here.
zh_hant: 伺服器上需要裝好 mosh，並放行 UDP 60000–61000 連接埠。如果 mosh-server 不在 PATH 里，在這裡填完整路徑。

source: 服务器下载
en: Server Downloads
zh_hant: 伺服器下載

source: 服务器状态
en: Server Status
zh_hant: 伺服器狀態

source: 服务器状态目前只支持 Linux，这台是 %@。
en: Server status supports Linux only for now; this one runs %@.
zh_hant: 伺服器狀態目前只支援 Linux，這台是 %@。

source: 服务器：
en: Servers:
zh_hant: 伺服器：

source: 服务：%@
en: Service: %@
zh_hant: 服務：%@

source: 朗读
en: Speak
zh_hant: 朗讀

source: 未充电
en: not charging
zh_hant: 未充電

source: 未填写
en: Not set
zh_hant: 未填寫

source: 未安装
en: Not Installed
zh_hant: 未安裝

source: 未开启
en: Off
zh_hant: 未開啟

source: 未提交的改动
en: Uncommitted Changes
zh_hant: 未提交的改動

source: 未知
en: Unknown

source: 未知错误
en: Unknown error
zh_hant: 未知錯誤

source: 未设置
en: Not set
zh_hant: 未設定

source: 未运行
en: Not Running
zh_hant: 未執行

source: 未连接
en: Not connected
zh_hant: 未連線

source: 未选择
en: None
zh_hant: 未選擇

source: 本对话已允许
en: Allowed in This Conversation
zh_hant: 本對話已允許

source: 本对话都允许
en: Allow in This Chat
zh_hant: 本對話都允許

source: 本机
en: This Device
zh_hant: 本機

source: 本机名称
en: Device Name
zh_hant: 本機名稱

source: 本机地址
en: This Device's Addresses
zh_hant: 本機位址

# 本机：%@ %@
source: 本机：%1$@ %2$@
en: This device: %@ %@
zh_hant: 本機：%@ %@

source: 本项目
en: This Project
zh_hant: 本專案

source: 权限
en: Permissions
zh_hant: 權限

source: 权限模式
en: Permission Mode
zh_hant: 權限模式

source: 权限模式改为绕过：什么都不问
en: Permission mode Bypass: never ask
zh_hant: 權限模式改為繞過：什麼都不問

source: 权限模式改为自动：只有危险操作才问
en: Permission mode Auto: ask only for risky actions
zh_hant: 權限模式改為自動：只有危險操作才問

source: 权限模式改为询问：每次操作前都问
en: Permission mode Ask: ask before every action
zh_hant: 權限模式改為詢問：每次操作前都問

source: 权限模式：%@
en: Permission mode: %@
zh_hant: 權限模式：%@

source: 来自 %@ 的消息
en: Message from %@
zh_hant: 來自 %@ 的訊息

source: 查一下 Tailscale 最新版本更新了什么
en: What's new in the latest Tailscale release?
zh_hant: 查一下 Tailscale 最新版本更新了什麼

source: 查了 %lld 次网页
en: looked up the web %lld times
zh_hant: 查了 %lld 次網頁

source: 查找文件
en: Find Files
zh_hant: 查找檔案

source: 查找文件 %@
en: Find files %@
zh_hant: 查找檔案 %@

source: 查看 MCP 服务器
en: Show MCP servers
zh_hant: 查看 MCP 伺服器

source: 查看 Tailscale
en: Check Tailscale

source: 查看上下文用了多少
en: Show how much context is used

source: 查看可用的子代理
en: Show available subagents

source: 查看后台命令
en: Check Background Command
zh_hant: 查看後台命令

source: 查看和管理助手记住的事
en: View and manage what the assistant remembers
zh_hant: 檢視和管理助理記住的事

source: 查看图片
en: View image
zh_hant: 查看圖片

source: 查看当前对话的会话、模型、权限模式
en: Show this conversation's session, model and permission mode
zh_hant: 查看當前對話的會話、模型、權限模式

source: 查看提醒事项
en: Check Reminders
zh_hant: 查看提醒事項

source: 查看提醒通知
en: Check Scheduled Notifications

source: 查看日程
en: Check Calendar
zh_hant: 查看行事曆事件

source: 查看服务、模型、权限模式
en: Show service, model and permission mode
zh_hant: 檢視服務、模型、權限模式

source: 查看本次会话的花费和用量
en: Show this session's cost and usage
zh_hant: 查看本次會話的花費和用量

source: 查看状态
en: Check Status
zh_hant: 查看狀態

# 查看目录 %@%@
source: 查看目录 %1$@%2$@
en: List %@%@
zh_hant: 查看目錄 %@%@

source: 查看网页
en: Read the page
zh_hant: 查看網頁

source: 查看设备状态
en: Check Device Status
zh_hant: 查看設備狀態

source: 查看项目里还没提交的改动
en: Show uncommitted changes in the project
zh_hant: 查看專案里還沒提交的改動

source: 标签页 %lld
en: Tab %lld
zh_hant: 分頁 %lld

source: 核对数字
en: Compare Codes
zh_hant: 核對數字

source: 检查中…
en: Checking…
zh_hant: 檢查中…

source: 检查改动里能简化、复用的地方并修改
en: Find what can be simplified or reused in the changes, and fix it
zh_hant: 檢查改動里能簡化、復用的地方並修改

source: 模型
en: Model

source: 模型名称
en: Model name
zh_hant: 模型名稱

source: 模型拒绝了这个请求。换个说法试试。
en: The model declined this request. Try rephrasing it.
zh_hant: 模型拒絕了這個請求。換個說法試試。

source: 模型：%@
en: Model: %@

source: 正在上传 %lld 个附件…
en: Uploading %lld attachments…
zh_hant: 正在上傳 %lld 個附件…

source: 正在从 %@ 接收…
en: Receiving from %@…
zh_hant: 正在從 %@ 接收…

source: 正在保持连接
en: Keeping connections alive
zh_hant: 正在保持連線

source: 正在保持连接，%@ 结束
en: Keeping connections alive until %@
zh_hant: 正在保持連線，%@ 結束

source: 正在发送…
en: Sending…
zh_hant: 正在傳送…

source: 正在启动
en: starting
zh_hant: 正在啟動

source: 正在启动…
en: Starting…
zh_hant: 正在啟動…

source: 正在审查：%@
en: Reviewing: %@
zh_hant: 正在審查：%@

source: 正在思考
en: Thinking

source: 正在打断当前这一步…
en: Interrupting the current step…
zh_hant: 正在打斷當前這一步…

source: 正在朗读
en: Speaking
zh_hant: 正在朗讀

source: 正在查找附近的设备…
en: Looking for nearby devices…
zh_hant: 正在尋找附近的裝置…

source: 正在查询地点…
en: Looking up place…
zh_hant: 正在查詢地點…

source: 正在第 %lld 次重连…
en: Reconnecting, attempt %lld…
zh_hant: 正在第 %lld 次重連…

source: 正在等待 mosh-server 响应…（请确认服务器已放行 UDP %u 端口）
en: Waiting for mosh-server… (make sure the server allows UDP port %u)
zh_hant: 正在等待 mosh-server 響應…（請確認伺服器已放行 UDP %u 連接埠）

source: 正在等用户在终端里输入密码（没有保存密码）。
en: Waiting for the user to enter the password in the terminal (no password is saved).
zh_hant: 正在等使用者在終端里輸入密碼（沒有保存密碼）。

source: 正在等用户确认主机指纹（首次连接）。请提示用户核对后点“信任并连接”。
en: Waiting for the user to confirm the host fingerprint (first connection). Ask them to check it and tap “Trust and Connect”.
zh_hant: 正在等使用者確認主機指紋（首次連線）。請提示使用者核對後點“信任並連線”。

source: 正在获取登录链接…
en: Getting the sign-in link…
zh_hant: 正在取得登入連結…

source: 正在读取历史记录…
en: Loading history…
zh_hant: 正在讀取歷史記錄…

source: 正在读取可用的模型…
en: Loading available models…
zh_hant: 正在讀取可用的模型…

source: 正在读取服务器状态…
en: Reading server status…
zh_hant: 正在讀取伺服器狀態…

source: 正在读取项目文件…
en: Reading project files…
zh_hant: 正在讀取專案檔案…

source: 正在连接 %@
en: Connecting to %@
zh_hant: 正在連線 %@

source: 正在连接 %@…
en: Connecting to %@…
zh_hant: 正在連線 %@…

source: 正在连接 %@，检查已安装的工具…
en: Connecting to %@ and checking installed tools…
zh_hant: 正在連線 %@，檢查已安裝的工具…

source: 正常
en: Normal

source: 步骤太多，先停在这里。需要的话告诉我继续。
en: That took too many steps, so I stopped here. Tell me to continue if needed.
zh_hant: 步驟太多，先停在這裡。需要的話告訴我繼續。

source: 每 %lld 秒向服务器发一次心跳，防止路由器、防火墙或 Tailscale 因为空闲断开连接；连续 %lld 次（约 %lld 秒）没有回应就判定断线并自动重连。相当于 OpenSSH 的 ServerAliveInterval 和 ServerAliveCountMax。新设置对之后建立的连接生效。
en: Sends a heartbeat every %lld seconds so routers, firewalls or Tailscale don't drop an idle connection; %lld missed replies in a row (about %lld seconds) count as a drop and trigger a reconnect. Same as OpenSSH's ServerAliveInterval and ServerAliveCountMax. Applies to new connections.
zh_hant: 每 %lld 秒向伺服器發一次心跳，防止路由器、防火牆或 Tailscale 因為空閒中斷連線；連續 %lld 次（約 %lld 秒）沒有回應就判定斷線並自動重連。相當於 OpenSSH 的 ServerAliveInterval 和 ServerAliveCountMax。新設定對之後建立的連線生效。

source: 每 2 秒更新 · 通过 SSH 读取，服务器上不用装任何东西
en: Updates every 2 seconds · Read over SSH, nothing to install on the server
zh_hant: 每 2 秒更新 · 透過 SSH 讀取，伺服器上不用安裝任何東西

source: 每核占用
en: Per core
zh_hant: 每核使用率

source: 每次执行命令、改动服务器或设备之前都先问你。
en: Asks before every command and every change to a server or device.
zh_hant: 每次執行命令、改動伺服器或設備之前都先問你。

source: 每次连上服务器时，记下时间和大致地点，方便回看在哪里、什么时候连过哪台服务器。只保存在本机，可随时清空。
en: Each time you connect to a server, records the time and rough location, so you can look back at where and when you connected to which server. Stored only on this device; clear it any time.
zh_hant: 每次連上伺服器時，記下時間和大致地點，方便回看在哪裡、什麼時候連過哪台伺服器。只保存在本機，可隨時清空。

source: 没找到“%@”
en: “%@” not found
zh_hant: 沒找到“%@”

source: 没有其他对话
en: No Other Conversations
zh_hant: 沒有其他對話

source: 没有历史会话
en: No History
zh_hant: 沒有歷史會話

source: 没有发送成功
en: Couldn't Send
zh_hant: 沒有傳送成功

source: 没有可问的问题
en: No questions to ask
zh_hant: 沒有可問的問題

source: 没有定位权限，去设置里允许
en: No location access. Allow it in Settings
zh_hant: 沒有定位權限，去設定里允許

source: 没有定位权限，后台保持连接和地点记录都无法使用
en: Without location access, background keep-alive and location records can't work
zh_hant: 沒有定位權限，後台保持連線和地點記錄都無法使用

# 没有工作表“%@”，有：%@
source: 没有工作表“%1$@”，有：%2$@
en: No sheet “%@”; there are: %@
zh_hant: 沒有工作表“%@”，有：%@

source: 没有已知主机
en: No Known Hosts
zh_hant: 沒有已知主機

source: 没有待触发的提醒
en: No pending reminders
zh_hant: 沒有待觸發的提醒

source: 没有找到“%@”
en: “%@” wasn't found
zh_hant: 沒有找到“%@”

source: 没有找到匹配的文件
en: No matching files
zh_hant: 沒有找到匹配的檔案
